n = int(input())
# 하나 더 필요했나?
a = [[0, []] for _ in range(n + 1)]
a[1][0] = 0
a[1][1] = [1]

# 조건
# 1. 빼기
# 2. 3나누기
# 3. 2나누기

for i in range(2, n + 1):
    a[i][0] = a[i - 1][0] + 1
    a[i][1] = a[i - 1][1] + [i]
    if i % 3 == 0 and a[i // 3][0] + 1 < a[i][0]:
        a[i][0] = a[i // 3][0] + 1
        a[i][1] = a[i // 3][1] + [i]
    if i % 2 == 0 and a[i // 2][0] + 1 < a[i][0]:
        a[i][0] = a[i // 2][0] + 1
        a[i][1] = a[i // 2][1] + [i]

print(a)
print(a[n][0])

print(*a[n][1][::-1])
